---
title: CriticalPathIterator
classe: Autodesk.Revit.DB.Analysis.CriticalPathIterator
namespace: Autodesk.Revit.DB.Analysis
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# CriticalPathIterator

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `MEPNetworkSegmentId Current { get; }` | `criticalPathIterator.Current` | MEPNetworkSegmentId |
| `Boolean IsValidObject { get; }` | `criticalPathIterator.IsValidObject` | Boolean |
| `Void Dispose()` | `criticalPathIterator.Dispose()` | Void |
| `MEPNetworkSegmentId GetCurrent()` | `criticalPathIterator.GetCurrent()` | MEPNetworkSegmentId |
| `Boolean IsDone()` | `criticalPathIterator.IsDone()` | Boolean |
| `Boolean MoveNext()` | `criticalPathIterator.MoveNext()` | Boolean |
| `Void Reset()` | `criticalPathIterator.Reset()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```